In [1]:
import numpy as np
import pandas as pd

In [2]:
dict1 = {
    "name":['Deepu', 'Chandu', 'Mehek', 'Chintu'],
    "marks":[85, 70, 91, 30],
    "city":['Bengaluru', 'Hyderabad', 'Lucknow', 'Delhi']
}

In [3]:
dataframe = pd.DataFrame(dict1)

In [4]:
dataframe

     name  marks       city
0   Deepu     85  Bengaluru
1  Chandu     70  Hyderabad
2   Mehek     91    Lucknow
3  Chintu     30      Delhi

In [5]:
dataframe.to_csv('demo_csv1')

In [6]:
dataframe.to_csv('demo_csv1_index_false.csv', index=False)

In [7]:
dataframe.head(2)

     name  marks       city
0   Deepu     85  Bengaluru
1  Chandu     70  Hyderabad

In [8]:
dataframe.tail(2)

     name  marks     city
2   Mehek     91  Lucknow
3  Chintu     30    Delhi

In [9]:
dataframe.describe()

          marks
count   4.00000
mean   69.00000
std    27.45906
min    30.00000
25%    60.00000
50%    77.50000
75%    86.50000
max    91.00000

In [10]:
train_df = pd.read_csv('train_read_csv.csv')

In [11]:
train_df

   train_no station_city            train_name
0    123321    Hyderabad        Konark Express
1    333771    Bengaluru      Prasanti Express
2    637290       Odisha  Faluknamma Superfast
3    739202     Kolkatta     Howrah Yesmantpur
4    242627      Chennai          chennai mail
5    345272         Puri     Puri Durg Express

In [12]:
train_df['train_no']

0    123321
1    333771
2    637290
3    739202
4    242627
5    345272
Name: train_no, dtype: int64

In [13]:
train_df['train_no'][0] = 222222

C:\Users\Futurense\AppData\Local\Temp\ipykernel_30848\1948925443.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  train_df['train_no'][0] = 222222

In [14]:
train_df

   train_no station_city            train_name
0    222222    Hyderabad        Konark Express
1    333771    Bengaluru      Prasanti Express
2    637290       Odisha  Faluknamma Superfast
3    739202     Kolkatta     Howrah Yesmantpur
4    242627      Chennai          chennai mail
5    345272         Puri     Puri Durg Express

In [15]:
train_df.dtypes

train_no         int64
station_city    object
train_name      object
dtype: object

# Note : if we specify the file_name which we read earlier that file will be update

# Here, I used different diff_file_name.

In [16]:
train_df.to_csv('afterreadupdate_write_train.csv',index = False)

In [17]:
train_df.index = ['1st','2nd','3rd','4th','5th','6th']

In [18]:
train_df

     train_no station_city            train_name
1st    222222    Hyderabad        Konark Express
2nd    333771    Bengaluru      Prasanti Express
3rd    637290       Odisha  Faluknamma Superfast
4th    739202     Kolkatta     Howrah Yesmantpur
5th    242627      Chennai          chennai mail
6th    345272         Puri     Puri Durg Express

In [19]:
seriz = pd.Series(np.random.rand(34))

In [20]:
type(seriz)

pandas.core.series.Series

In [21]:
seriz

0     0.297243
1     0.514251
2     0.580742
3     0.257232
4     0.967597
5     0.060018
6     0.403049
7     0.486372
8     0.174394
9     0.671806
10    0.013002
11    0.664614
12    0.611897
13    0.260796
14    0.546571
15    0.011532
16    0.080711
17    0.128953
18    0.996431
19    0.747178
20    0.773954
21    0.024732
22    0.530124
23    0.150198
24    0.503260
25    0.560118
26    0.374398
27    0.948875
28    0.920314
29    0.129122
30    0.603708
31    0.108330
32    0.773696
33    0.048476
dtype: float64

In [22]:
new_datafarame = pd.DataFrame(np.random.rand(300, 5), index = np.arange(300))

In [23]:
new_datafarame

            0         1         2         3         4
0    0.339604  0.819225  0.900179  0.022882  0.906727
1    0.360385  0.517018  0.750210  0.967018  0.817689
2    0.386937  0.549849  0.473805  0.609572  0.935661
3    0.389744  0.897839  0.509777  0.502655  0.856741
4    0.632509  0.682925  0.955647  0.851114  0.777490
..        ...       ...       ...       ...       ...
295  0.692645  0.344973  0.902319  0.190703  0.235013
296  0.334894  0.693097  0.931750  0.411925  0.990339
297  0.565252  0.893606  0.230160  0.752011  0.795448
298  0.023687  0.565213  0.070335  0.595173  0.567491
299  0.383024  0.670290  0.773308  0.637047  0.227745

[300 rows x 5 columns]

In [24]:
type(new_datafarame)

pandas.core.frame.DataFrame

In [25]:
new_datafarame.describe()

                0           1           2           3           4
count  300.000000  300.000000  300.000000  300.000000  300.000000
mean     0.482210    0.502225    0.505872    0.523386    0.517577
std      0.279959    0.283990    0.289472    0.288906    0.287757
min      0.001608    0.005528    0.001754    0.010227    0.002065
25%      0.234392    0.255638    0.261538    0.264902    0.270729
50%      0.480979    0.483446    0.516549    0.565815    0.528517
75%      0.709713    0.723986    0.773079    0.761592    0.762686
max      0.999841    0.996613    0.996211    0.996532    0.995544

In [26]:
new_datafarame.dtypes

0    float64
1    float64
2    float64
3    float64
4    float64
dtype: object

In [27]:
new_datafarame.head()

          0         1         2         3         4
0  0.339604  0.819225  0.900179  0.022882  0.906727
1  0.360385  0.517018  0.750210  0.967018  0.817689
2  0.386937  0.549849  0.473805  0.609572  0.935661
3  0.389744  0.897839  0.509777  0.502655  0.856741
4  0.632509  0.682925  0.955647  0.851114  0.777490

In [28]:
new_datafarame[0][1] = "Deepu"
new_datafarame.head()

          0         1         2         3         4
0  0.339604  0.819225  0.900179  0.022882  0.906727
1     Deepu  0.517018  0.750210  0.967018  0.817689
2  0.386937  0.549849  0.473805  0.609572  0.935661
3  0.389744  0.897839  0.509777  0.502655  0.856741
4  0.632509  0.682925  0.955647  0.851114  0.777490

In [29]:
new_datafarame.duplicated()

In [30]:
new_datafarame.index

In [ ]:
new_datafarame.columns

# convert a array to numpy array

In [39]:
np_array = new_datafarame.to_numpy()

In [40]:
np_array

array([[0.33960430183695234, 0.819224524663159, 0.9001792569067435,
        0.022882160417257547, 0.9067271704356397],
       [0.3333333333, 0.5170181718599195, 0.7502101826935614,
        0.9670175119096937, 0.8176892169965768],
       [0.38693701598700403, 0.5498493308548358, 0.4738048186921313,
        0.6095717640563819, 0.935661221650568],
       ...,
       [0.565252301948485, 0.8936060677641077, 0.23015969191934382,
        0.7520107209336271, 0.7954478336417595],
       [0.023687194596253458, 0.5652128574151449, 0.07033461453677803,
        0.595173397210878, 0.5674908205897009],
       [0.38302415325818706, 0.6702900932711279, 0.7733075433931745,
        0.6370474567126425, 0.22774459830757166]], dtype=object)

In [41]:
print(np_array[0])

[0.33960430183695234 0.819224524663159 0.9001792569067435
 0.022882160417257547 0.9067271704356397]

In [42]:
new_datafarame.head()

          0         1         2         3         4
0  0.339604  0.819225  0.900179  0.022882  0.906727
1  0.333333  0.517018  0.750210  0.967018  0.817689
2  0.386937  0.549849  0.473805  0.609572  0.935661
3  0.389744  0.897839  0.509777  0.502655  0.856741
4  0.632509  0.682925  0.955647  0.851114  0.777490

In [43]:
new_datafarame[0][1] = 0.3333333333

In [44]:
new_datafarame

            0         1         2         3         4
0    0.339604  0.819225  0.900179  0.022882  0.906727
1    0.333333  0.517018  0.750210  0.967018  0.817689
2    0.386937  0.549849  0.473805  0.609572  0.935661
3    0.389744  0.897839  0.509777  0.502655  0.856741
4    0.632509  0.682925  0.955647  0.851114  0.777490
..        ...       ...       ...       ...       ...
295  0.692645  0.344973  0.902319  0.190703  0.235013
296  0.334894  0.693097  0.931750  0.411925  0.990339
297  0.565252  0.893606  0.230160  0.752011  0.795448
298  0.023687  0.565213  0.070335  0.595173  0.567491
299  0.383024  0.670290  0.773308  0.637047  0.227745

[300 rows x 5 columns]

In [45]:
# Transpose
new_datafarame.T

,0,1,2,3,4,5,6,7,8,9,...,290,291,292,293,294,295,296,297,298,299
0,0.339604,0.333333,0.386937,0.389744,0.632509,0.991992,0.218573,0.705431,0.163813,0.060655,...,0.40632,0.919892,0.722146,0.580063,0.804224,0.692645,0.334894,0.565252,0.023687,0.383024
1,0.819225,0.517018,0.549849,0.897839,0.682925,0.372834,0.522298,0.201493,0.248033,0.425881,...,0.045309,0.749458,0.678764,0.340308,0.426898,0.344973,0.693097,0.893606,0.565213,0.67029
2,0.900179,0.75021,0.473805,0.509777,0.955647,0.726601,0.134913,0.213152,0.53151,0.229439,...,0.665066,0.416714,0.820108,0.777416,0.902674,0.902319,0.93175,0.23016,0.070335,0.773308
3,0.022882,0.967018,0.609572,0.502655,0.851114,0.386759,0.262414,0.499765,0.087553,0.220485,...,0.987489,0.934069,0.145875,0.93717,0.165828,0.190703,0.411925,0.752011,0.595173,0.637047
4,0.906727,0.817689,0.935661,0.856741,0.77749,0.635119,0.498875,0.143881,0.711348,0.335289,...,0.480312,0.387548,0.950545,0.945764,0.283763,0.235013,0.990339,0.795448,0.567491,0.227745

In [46]:
new_datafarame.head()

          0         1         2         3         4
0  0.339604  0.819225  0.900179  0.022882  0.906727
1  0.333333  0.517018  0.750210  0.967018  0.817689
2  0.386937  0.549849  0.473805  0.609572  0.935661
3  0.389744  0.897839  0.509777  0.502655  0.856741
4  0.632509  0.682925  0.955647  0.851114  0.777490

In [49]:
# axis = 0 means row and axis=1 meams column
new_datafarame.sort_index(axis = 0, ascending=False)

            0         1         2         3         4
299  0.383024  0.670290  0.773308  0.637047  0.227745
298  0.023687  0.565213  0.070335  0.595173  0.567491
297  0.565252  0.893606  0.230160  0.752011  0.795448
296  0.334894  0.693097  0.931750  0.411925  0.990339
295  0.692645  0.344973  0.902319  0.190703  0.235013
..        ...       ...       ...       ...       ...
4    0.632509  0.682925  0.955647  0.851114  0.777490
3    0.389744  0.897839  0.509777  0.502655  0.856741
2    0.386937  0.549849  0.473805  0.609572  0.935661
1    0.333333  0.517018  0.750210  0.967018  0.817689
0    0.339604  0.819225  0.900179  0.022882  0.906727

[300 rows x 5 columns]

In [50]:
new_datafarame.sort_index(axis = 1, ascending=False)

            4         3         2         1         0
0    0.906727  0.022882  0.900179  0.819225  0.339604
1    0.817689  0.967018  0.750210  0.517018  0.333333
2    0.935661  0.609572  0.473805  0.549849  0.386937
3    0.856741  0.502655  0.509777  0.897839  0.389744
4    0.777490  0.851114  0.955647  0.682925  0.632509
..        ...       ...       ...       ...       ...
295  0.235013  0.190703  0.902319  0.344973  0.692645
296  0.990339  0.411925  0.931750  0.693097  0.334894
297  0.795448  0.752011  0.230160  0.893606  0.565252
298  0.567491  0.595173  0.070335  0.565213  0.023687
299  0.227745  0.637047  0.773308  0.670290  0.383024

[300 rows x 5 columns]

In [52]:
# nothing will change
new_datafarame.sort_index(axis = 0)

            0         1         2         3         4
0    0.339604  0.819225  0.900179  0.022882  0.906727
1    0.333333  0.517018  0.750210  0.967018  0.817689
2    0.386937  0.549849  0.473805  0.609572  0.935661
3    0.389744  0.897839  0.509777  0.502655  0.856741
4    0.632509  0.682925  0.955647  0.851114  0.777490
..        ...       ...       ...       ...       ...
295  0.692645  0.344973  0.902319  0.190703  0.235013
296  0.334894  0.693097  0.931750  0.411925  0.990339
297  0.565252  0.893606  0.230160  0.752011  0.795448
298  0.023687  0.565213  0.070335  0.595173  0.567491
299  0.383024  0.670290  0.773308  0.637047  0.227745

[300 rows x 5 columns]

In [53]:
# view Vs copy

# In view(newdf2) its just a pointer to your original dafaframe(new_datafarme) like SQL view

newdf2 = new_datafarame
newdf2[0][0] = 1111111111

C:\Users\Futurense\AppData\Local\Temp\ipykernel_30848\3654930094.py:6: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  newdf2[0][0] = 1111111111

In [54]:
new_datafarame

              0         1         2         3         4
0    1111111111  0.819225  0.900179  0.022882  0.906727
1      0.333333  0.517018  0.750210  0.967018  0.817689
2      0.386937  0.549849  0.473805  0.609572  0.935661
3      0.389744  0.897839  0.509777  0.502655  0.856741
4      0.632509  0.682925  0.955647  0.851114  0.777490
..          ...       ...       ...       ...       ...
295    0.692645  0.344973  0.902319  0.190703  0.235013
296    0.334894  0.693097  0.931750  0.411925  0.990339
297    0.565252  0.893606  0.230160  0.752011  0.795448
298    0.023687  0.565213  0.070335  0.595173  0.567491
299    0.383024  0.670290  0.773308  0.637047  0.227745

[300 rows x 5 columns]

In [55]:
newdf2

              0         1         2         3         4
0    1111111111  0.819225  0.900179  0.022882  0.906727
1      0.333333  0.517018  0.750210  0.967018  0.817689
2      0.386937  0.549849  0.473805  0.609572  0.935661
3      0.389744  0.897839  0.509777  0.502655  0.856741
4      0.632509  0.682925  0.955647  0.851114  0.777490
..          ...       ...       ...       ...       ...
295    0.692645  0.344973  0.902319  0.190703  0.235013
296    0.334894  0.693097  0.931750  0.411925  0.990339
297    0.565252  0.893606  0.230160  0.752011  0.795448
298    0.023687  0.565213  0.070335  0.595173  0.567491
299    0.383024  0.670290  0.773308  0.637047  0.227745

[300 rows x 5 columns]

In [56]:
# In copy perticularly you are copying your dataframe(new_dataframe) into another variable(newdf2)

newdf2 = new_datafarame.copy()

In [57]:
newdf2.head()

            0         1         2         3         4
0  1111111111  0.819225  0.900179  0.022882  0.906727
1    0.333333  0.517018  0.750210  0.967018  0.817689
2    0.386937  0.549849  0.473805  0.609572  0.935661
3    0.389744  0.897839  0.509777  0.502655  0.856741
4    0.632509  0.682925  0.955647  0.851114  0.777490

In [58]:
# This is not recommended to chnage value if we are using chaining to modify a value then 
#sometime it doesn't return copy it returns view and sometime copy so its confusion so not recommended

newdf2[0][0] = 9999999

C:\Users\Futurense\AppData\Local\Temp\ipykernel_30848\3976165441.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  newdf2[0][0] = 9999999

In [66]:
newdf2.head()

          0         1         2         3         4
0   9999999  0.819225  0.900179  0.022882  0.906727
1  0.333333  0.517018  0.750210  0.967018  0.817689
2  0.386937  0.549849  0.473805  0.609572  0.935661
3  0.389744  0.897839  0.509777  0.502655  0.856741
4  0.632509  0.682925  0.955647  0.851114  0.777490

In [64]:
new_datafarame.head()

            0         1         2         3         4
0  1111111111  0.819225  0.900179  0.022882  0.906727
1    0.333333  0.517018  0.750210  0.967018  0.817689
2    0.386937  0.549849  0.473805  0.609572  0.935661
3    0.389744  0.897839  0.509777  0.502655  0.856741
4    0.632509  0.682925  0.955647  0.851114  0.777490

In [61]:
# or you can do copy like this using slicing [:]
newdf3 = new_datafarame[:]

In [63]:
newdf3.head()

            0         1         2         3         4
0  1111111111  0.819225  0.900179  0.022882  0.906727
1    0.333333  0.517018  0.750210  0.967018  0.817689
2    0.386937  0.549849  0.473805  0.609572  0.935661
3    0.389744  0.897839  0.509777  0.502655  0.856741
4    0.632509  0.682925  0.955647  0.851114  0.777490

In [67]:
# This is not recommended to chnage value if we are using chaining to modify a value then 
#sometime it doesn't return copy it returns view and sometime copy so its confusion so not recommended

newdf3[0][0] = "Deepu"

C:\Users\Futurense\AppData\Local\Temp\ipykernel_30848\1155146669.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  newdf3[0][0] = "Deepu"

In [68]:
newdf3.head()

          0         1         2         3         4
0     Deepu  0.819225  0.900179  0.022882  0.906727
1  0.333333  0.517018  0.750210  0.967018  0.817689
2  0.386937  0.549849  0.473805  0.609572  0.935661
3  0.389744  0.897839  0.509777  0.502655  0.856741
4  0.632509  0.682925  0.955647  0.851114  0.777490

In [69]:
new_datafarame.head()

          0         1         2         3         4
0     Deepu  0.819225  0.900179  0.022882  0.906727
1  0.333333  0.517018  0.750210  0.967018  0.817689
2  0.386937  0.549849  0.473805  0.609572  0.935661
3  0.389744  0.897839  0.509777  0.502655  0.856741
4  0.632509  0.682925  0.955647  0.851114  0.777490

In [ ]:
newdf3